//
//  OmerTexts.swift
//  Omer Counter
//
//  Created by Orel Zion on 15/04/2021.
//

import Foundation

let beforeOmer = "לְשֵׁם יִחוּד קֻדְשָׁא בְרִיךְ הוּא וּשְׁכִינְתֵּיהּ, בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ, לְיַחֲדָא שֵׁם י\"ה בו\"ה בְּיִחוּדָא שְׁלִים (יהוה) בְּשֵׁם כָּל יִשְׂרָאֵל. הִנֵּה אֲנַחְנוּ בָּאִים לְקַיֵּם מִצְוַת סְפִירַת הָעֹמֶר, <br> <small>לדעת הגר\"ע יוסף, אין לומר את הפסוקים הבאים </small><br>כְּדִכְתִיב: וּסְפַרְתֶּם לָכֶם מִמָּחֳרַת הַשַּׁבָּת מִיּוֹם הֲבִיאֲכֶם אֶת עֹמֶר הַתְּנוּפָה, שֶׁבַע שַׁבָּתוֹת תְּמִימֹת תִּהְיֶינָה: עַד מִמָּחֳרַת הַשַּׁבָּת הַשְּׁבִיעִת תִּסְפְּרוּ חֲמִשִּׁים יוֹם, וְהִקְרַבְתֶּם מִנְחָה חֲדָשָׁה לַיהֹוָה: <small> <br>עד כאן </small><br>לְתַקֵּן אֶת שָׁרְשָׁהּ בְּמָקוֹם עֶלְיוֹן. לַעֲשׂוֹת נַחַת רוּחַ לְיוֹצְרֵנוּ וְלַעֲשׂוֹת רְצוֹן בּוֹרְאֵנוּ. וִיהִי נֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ. יְהֹוָה יִגְמֹר בַּעֲדִי, יְהֹוָה חַסְדְּךָ לְעוֹלָם, מַעֲשֵׂי יָדֶיךָ אַל תֶּרֶף אֶקְרָא לֵאלֹהִים עֶלְיוֹן, לָאֵל גֹּמֵר עָלָי וָאֶעֱבֹר עָלַיִךְ וָאֶרְאֵךְ מִתְבּוֹסֶסֶת בְּדָמָיִךְ. וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי וָאֹמַר לָךְ בְּדָמַיִךְ חֲיִי. בָּרְכִי נַפְשִׁי אֶת יְהֹוָה. יְהֹוָה אֱלֹהַי גָּדַלְתָּ מְּאֹד. הוֹד וְהָדָר לָבָשְׁתָּ עֹטֶה אוֹר כַּשַּׂלְמָה. נוֹטֶה שָׁמַיִם כַּיְרִיעָה. <br><br>בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל סְפִירַת הָעֹמֶר"

let afterOmer = "הָרַחֲמָן הוּא יַחֲזִיר עֲבוֹדַת בֵּית הַמִּקְדָּשׁ לִמְקוֹמָהּ בִּמְהֵרָה בְיָמֵינוּ אָמֵן.<br><br>לַמְנַצֵּחַ בִּנְגִינֹת מִזְמוֹר שִׁיר אֱלֹהִים יְחָנֵּנוּ וִיבָרְכֵנוּ. יָאֵר פָּנָיו אִתָּנוּ סֶלָה לָדַעַת בָּאָרֶץ דַּרְכֶּךָ. בְּכָל גּוֹיִם יְשׁוּעָתֶךָ. יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם. יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים. כִּי תִשְׁפֹּט עַמִּים מִישֹׁר. וּלְאֻמִּים בָּאָרֶץ תַּנְחֵם סֶלָה. יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם. אֶרֶץ נָתְנָה יְבוּלָהּ. יְבָרְכֵנוּ אֱלֹהִים אֱלֹהֵינוּ. יְבָרְכֵנוּ אֱלֹהִים. וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָרֶץ.<br><br>אָנָּא בְּכֹחַ, גְּדֻלַּת יְמִינֶךָ, תַּתִּיר צְרוּרָה.<br>קַבֵּל רִנַּת, עַמֶּךָ. שַׂגְּבֵנוּ, טַהֲרֵנוּ נוֹרָא.<br>נָא גִבּוֹר, דּוֹרְשֵׁי יִחוּדֶךָ, כְּבָבַת שָׁמְרֵם.<br>בָּרְכֵם טַהֲרֵם, רַחֲמֵי צִדְקָתֶךָ, תָּמִיד גָּמְלֵם.<br>חָסִין קָדוֹשׁ, בְּרֹב טוּבְךָ, נַהֵל עֲדָתֶךָ.<br>יָחִיד גֵּאֶה, לְעַמְּךָ פְּנֵה, זוֹכְרֵי קְדֻשָּׁתֶךָ.<br>שַׁוְעָתֵנוּ קַבֵּל, וּשְׁמַע צַעֲקָתֵנוּ, יוֹדֵעַ תַּעֲלוּמוֹת.<br><small>%@</small> בָּרוּךְ, שֵׁם כְּבוֹד מַלְכוּתוֹֹ, לְעוֹלָם וָעֶד"

let omerDays = ["הַיּוֹם יוֹם אֶחָד לָעֹמֶר:",
            "הַיּוֹם שְׁנֵי יָמִים לָעוֹמֶר:",
            "הַיּוֹם שְׁלשָׁה יָמִים לָעוֹמֶר:",
            "הַיּוֹם אַרְבָּעָה יָמִים לָעוֹמֶר:",
            "הַיּוֹם חֲמִשָּׁה יָמִים לָעוֹמֶר:",
            "הַיּוֹם שִׁשָּׁה יָמִים לָעוֹמֶר:",
            "הַיּוֹם שִׁבְעָה יָמִים  לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד:",
            "הַיּוֹם שְׁמוֹנָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וְיוֹם אֶחָד:",
            "הַיּוֹם תִּשְׁעָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁנֵי יָמִים :",
            "הַיּוֹם עֲשָׂרָה יָמִים לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁלשָׁה יָמִים :",
            "הַיּוֹם אַחַד עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וְאַרְבָּעָה יָמִים :",
            "הַיּוֹם שְׁנֵים עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וַחֲמִשָּׁה יָמִים :",
            "הַיּוֹם שְׁלשָׁה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שָׁבוּעַ אֶחָד וְשִׁשָּׁה יָמִים :",
            "הַיּוֹם אַרְבָּעָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת :",
            "הַיּוֹם חֲמִשָּׁה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד :",
            "הַיּוֹם שִׁשָּׁה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים :",
            "הַיּוֹם שִׁבְעָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלשָׁה יָמִים :",
            "הַיּוֹם שְׁמוֹנָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְאַרְבָּעָה יָמִים :",
            "הַיּוֹם תִּשְׁעָה עָשָׂר יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים :",
            "הַיּוֹם עֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְשִׁשָּׁה יָמִים :",
            "הַיּוֹם אֶחָד וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת :",
            "הַיּוֹם שְׁנַיִם וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד :",
            "הַיּוֹם שְׁלשָׁה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים :",
            "הַיּוֹם אַרְבָּעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת וּשְׁלשָׁה יָמִים :",
            "הַיּוֹם חֲמִשָּׁה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים :",
            "הַיּוֹם שִׁשָּׁה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים :",
            "הַיּוֹם שִׁבְעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם שְׁלשָׁה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים :",
            "הַיּוֹם שְׁמוֹנָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת :",
            "הַיּוֹם תִּשְׁעָה וְעֶשְׂרִים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד :",
            "הַיּוֹם שְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים :",
            "הַיּוֹם אֶחָד וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלשָׁה יָמִים :",
            "הַיּוֹם שְׁנַיִם וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים :",
            "הַיּוֹם שְׁלשָׁה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים :",
            "הַיּוֹם אַרְבָּעָה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים :",
            "הַיּוֹם חֲמִשָּׁה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת :",
            "הַיּוֹם שִׁשָּׁה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וְיוֹם אֶחָד :",
            "הַיּוֹם שִׁבְעָה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים :",
            "הַיּוֹם שְׁמוֹנָה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וּשְׁלשָׁה יָמִים :",
            "הַיּוֹם תִּשְׁעָה וּשְׁלשִׁים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים :",
            "הַיּוֹם אַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים :",
            "הַיּוֹם אֶחָד וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים :",
            "הַיּוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת :",
            "הַיּוֹם שְׁלשָׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת וְיוֹם אֶחָד :",
            "הַיּוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים :",
            "הַיּוֹם חֲמִשָּׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת וּשְׁלֹשָׁה יָמִים :",
            "הַיּוֹם שִׁשָּׁה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים :",
            "הַיּוֹם שִׁבְעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים :",
            "הַיּוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁשָּׁה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים :",
            "הַיּוֹם תִּשְׁעָה וְאַרְבָּעִים יוֹם לָעוֹמֶר שֶׁהֵם שִׁבְעָה שָׁבוּעוֹת :",
]
